Revit 2027 API
DisplacementElement.CanElementsBeDisplaced(View, ICollection<ElementId>) Method
 Indicates if elements can be assigned to a new DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanElementsBeDisplaced(
	View view,
	ICollection<ElementId> elementIds
)
Public Shared Function CanElementsBeDisplaced (
	view As View,
	elementIds As ICollection(Of ElementId)
) As Boolean
public:
static bool CanElementsBeDisplaced(
	View^ view,
	ICollection<ElementId^>^ elementIds
)
static member CanElementsBeDisplaced :
        view : View *
        elementIds : ICollection<ElementId> -> bool
Parameters
view View
 The view.
elementIds ICollection<ElementId>
 The element ids.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A necessary condition is that isAllowedAsDisplacedElement returns true for each individual element id. In addition, if isElementDisplaced must return the same value for all the specified element ids.
See Also
Reference
DisplacementElement Class
CanElementsBeDisplaced Overload
Autodesk.Revit.DB Namespace